app/controllers/tasks_controller.rb

    def create
        @task = Task.create(task_params)
---
INSERT INTO "tasks" ("title", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Ruby tutorial"], ["note", "do 5 tutorials by end of week"], ["created_at", "2018-07-17 05:46:36.620940"], ["updated_at", "2018-07-17 05:46:36.620940"]]